shmoovies_api/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    @movies = Movie.all

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @movie = Movie.find(params[:id])